EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
volatile uint8_t row;
volatile uint8_t cmd;
volatile uint8_t data;
volatile UINT32 U32_lastCapture; // UINT32 declared in all_generic.h
#define KEYPAD_DELAY    100
#define KEYPAD_DEBOUNCE_DELAY 2

#define MAX_LABEL_LEN 10
#define NUM_LABELS 40
#define NUM_RT_PARAMS 10
volatile uint8_t col;
volatile uint8_t last_code;
volatile uint8_t user_flag;

#define NUM_RT_LABELS NUM_RT_PARAMS

volatile int label_offsets[NUM_LABELS+NUM_RT_LABELS];

volatile uint16_t total_offset;
volatile uint16_t no_menu_labels;
volatile uint16_t no_rtparams;
volatile uint16_t no_rt_labels;

volatile UCHAR avr_send_data[AVR_SEND_DATA_SIZE];
//volatile char state[30];

volatile char labels[NUM_LABELS][MAX_LABEL_LEN] =
//#if 0
{"home\0","MENU1a\0","MENU1b\0","MENU1c\0","MENU1d\0","MENU1e\0","MENU2a\0","MENU2B\0","MENU2c\0","MENU2d\0","MENU2e\0","MENU3a\0","MENU3b\0",\
\
"enter\0","up\0","down\0","toggle\0","esc\0","enter\0","forward\0","back\0","clear\0","escape\0",\
\
"caps\0","small\0","spec\0","next\0",\
\
"\0","RPM\0","ENG TEMP\0","TRIP\0","TIME\0","AIR TEMP\0","MPH\0","OIL PRES\0","MAP\0","OIL TEMP\0","O2\0","test\0"};
//#endif

RT_PARAM rt_params[NUM_RT_PARAMS] = {
 {1, 0, SHOWN_SENT, 1, RT_RPM},
 {2, 0, SHOWN_SENT, 0, RT_ENGT},
 {3, 0, SHOWN_SENT, 0, RT_TRIP},
 {4, 0, SHOWN_SENT, 0, RT_TIME},
 {5, 0, SHOWN_SENT, 0, RT_AIRT},
 {1, 15, SHOWN_SENT, 0, RT_MPH},
 {2, 15, SHOWN_SENT, 0, RT_OILP},
 {3, 15, SHOWN_SENT, 0, RT_MAP},
 {4, 15, SHOWN_SENT, 0, RT_OILT},
 {5, 15, SHOWN_SENT, 0, RT_O2} };


UCHAR get_keypress(UCHAR key1)
{
	UCHAR wkey;

	switch(key1)
	{
		case '0':
			wkey = KP_0;
			break;
		case '1':
			wkey = KP_1;
			break;
		case '2':
			wkey = KP_2;
			break;
		case '3':
			wkey = KP_3;
			break;
		case '4':
			wkey = KP_4;
			break;
		case '5':
			wkey = KP_5;
			break;
		case '6':
			wkey = KP_6;
			break;
		case '7':
			wkey = KP_7;
			break;
		case '8':
			wkey = KP_8;
			break;
		case '9':
			wkey = KP_9;
			break;
		case '*':
			wkey = KP_AST;
			break;
		case '#':
			wkey = KP_POUND;
			break;
		case 'A':
		case 'a':
			wkey = KP_A;
			break;
		case 'B':
		case 'b':
			wkey = KP_B;
			break;
		case 'C':
		case 'c':
			wkey = KP_C;
			break;
		case 'D':
		case 'd':
			wkey = KP_D;
			break;
// use 'z' as a shortcut to '*' and 'y' as a shortcut to '#'
		case 'Y':
		case 'y':
			wkey = KP_POUND;
			break;
		case 'Z':
		case 'z':
			wkey = KP_AST;
			break;

		case 'E':
		case 'e':
			wkey = READ_EEPROM;
			break;
		case 'V':
		case 'v':
			wkey = BURN_PART;
			break;
		case 'W':
		case 'w':
			wkey = BURN_PART2;
			break;
		case 'U':
		case 'u':
			wkey = BURN_PART3;
			break;
		case 'R':
		case 'r':
			wkey = BURN_PART4;
			break;
		case 'S':
		case 's':
			wkey = SYNC;
			break;
		case 'L':
		case 'l':
			wkey = TEST1;
			break;
		case 'T':
		case 't':
			wkey = TEST2;
			break;
		case 'P':
		case 'p':
			wkey = TEST3;
			break;
		case 'X':
		case 'x':
			wkey = TEST4;
			break;
		case 'Q':
		case 'q':
			wkey = TEST5;
			break;
		case 'F':
		case 'f':
			wkey = TEST6;
			break;
		case 'G':
		case 'g':
			wkey = TEST7;
			break;
		case 'H':
		case 'h':
			wkey = TEST8;
			break;
		case 'J':
		case 'j':
			wkey = TEST10;
			break;
		case 'M':
		case 'm':
			wkey = TEST11;
			break;
		case 'K':
		case 'k':
			wkey = TEST9;
			break;
		case 'I':
		case 'i':
			wkey = INIT;
			break;
		case ' ':
			wkey = SPACE;
			break;
		default:
			wkey = 0xff;
			break;
	}
	return wkey;
}

//#if 0
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
UCHAR menu_change(UCHAR ch)
{
	UCHAR ret_char = ch;
	int menu_index = 0;
	int curr_menu;

	curr_menu = get_curr_menu();
//	strcpy((char *)state,"menu_change       \0");
	switch(ch)
	{
		case KP_A:
		break;
		case KP_B:
		menu_index++;
		break;
		case KP_C:
		menu_index += 2;
		break;
		case KP_D:
		menu_index += 3;
		break;
		case KP_POUND:
		menu_index += 4;
		break;
		case KP_0:
		menu_index += 5;
		break;
		case KP_AST:
		prev_list();
		break;
		default:
		break;
	}
	if(ch != KP_AST)
		ret_char = set_list(menu_structs[curr_menu].menus[menu_index]);

	return ret_char;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
int prev_list(void)
{
	int ret;

	if(current_fptr == 0)
		ret = -1;
	else
	{
		menu_list[current_fptr] = 0;
		current_fptr--;
		dirty_flag = 1;
		ret = 0;
	}
	return ret;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
UCHAR set_list(int fptr)
{
	int i;
	UCHAR ret_char = 0;
//	char tlabel[MAX_LABEL_LEN];

	if(current_fptr < list_size)
	{
		current_fptr++;
		menu_list[current_fptr] = fptr;
		dirty_flag = 1;

		ret_char = get_curr_menu_index();
		send_aux_data = 0;
		if(menu_structs[get_curr_menu()].fptr != _menu_change)
		{
			switch(ret_char)
			{
				case MENU1C:	// 1st do_chkbox
				case MENU1D:	// 2nd do_chkbox
					init_checkboxes(ret_char);
				break;
				case MENU2A:	// 1st exec_choice
				case MENU2B:	// 2nd exec_choice
					init_execchoices(ret_char);
					curr_execchoice = 0;
				break;
				case MENU2C:	// do_numentry
				case MENU2D:
				case MENU2E:
				case MENU3A:
				case MENU3B:
//					init_numentry(ret_char);
				break;
				default:
					send_aux_data = 0;
				break;
			}
		}

	}
	return ret_char;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
UCHAR do_numentry(UCHAR ch)
{
	UCHAR ret_char = ch;
	char temp;

