EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
//	strcpy((char *)state,"do_numentry     \0");

	switch(ch)
	{
		case KP_0:
		cursor_forward_stuff(0);
		break;
		case KP_1:
		cursor_forward_stuff(1);
		break;
		case KP_2:
		cursor_forward_stuff(2);
		break;
		case KP_3:
		cursor_forward_stuff(3);
		break;
		case KP_4:
		cursor_forward_stuff(4);
		break;
		case KP_5:
		cursor_forward_stuff(5);
		break;
		case KP_6:
		cursor_forward_stuff(6);
		break;
		case KP_7:
		cursor_forward_stuff(7);
		break;
		case KP_8:
		cursor_forward_stuff(8);
		break;
		case KP_9:
		cursor_forward_stuff(9);
		break;
		case KP_A:
		cursor_forward(ch);
		break;
		case KP_B:
		backspace(ch);
		break;
		case KP_C:
		_eclear();
		break;
		case KP_D:
		enter(ch);
		prev_list();
		break;
		case KP_POUND:
		prev_list();
		break;
		case KP_AST:
			prev_list();
		break;
		default:
		break;
	}
	return ret_char;
}
//******************************************************************************************//
//******************************************* escape ***************************************//
//******************************************************************************************//
UCHAR escape(UCHAR ch)
{
	memset((void*)cur_global_number,0,NUM_ENTRY_SIZE);
	cur_col = NUM_ENTRY_BEGIN_COL;
	return ch;
}
//******************************************************************************************//
//******************************************* enter ****************************************//
//******************************************************************************************//
UCHAR enter(UCHAR ch)
{
	int limit;
	int index;
	if(1)
//	if(data_entry_mode)
	{
		limit = atoi((const char *)cur_global_number);
		if(limit > 32767)
			strcpy((char *)cur_global_number,"32766\0");
		memcpy((void*)new_global_number,(void*)cur_global_number,NUM_ENTRY_SIZE);
		cur_col = NUM_ENTRY_BEGIN_COL;

		index = get_curr_menu_index() - MENU2C;
		sample_numbers[index] = atoi((const char *)new_global_number);
	}
	memset((void*)new_global_number,0,NUM_ENTRY_SIZE);
	memset((void*)cur_global_number,0,NUM_ENTRY_SIZE);
	return ch;
}
//******************************************************************************************//
//*************************************** init_numentry ************************************//
//******************************************************************************************//
void init_numentry(int menu_index)
{
	int temp_int;
	cur_row = NUM_ENTRY_ROW;
	cur_col = NUM_ENTRY_BEGIN_COL;
//	memset((void*)new_global_number,0,NUM_ENTRY_SIZE);
	memset((void*)cur_global_number,0,NUM_ENTRY_SIZE);

//	send_aux_data = 2;

	temp_int = sample_numbers[menu_index-MENU2C];
	sprintf((char *)cur_global_number,"%4d",temp_int);
	avr_send_data[AVR_SEND_DATA_SIZE-1] = (UCHAR)temp_int;
	temp_int >>= 8;
	avr_send_data[AVR_SEND_DATA_SIZE-2] = (UCHAR)temp_int;
	cur_col = strlen((const char *)cur_global_number)+NUM_ENTRY_BEGIN_COL;
}
//******************************************************************************************//
//********************************** cursor_forward_stuff **********************************//
//******************************************************************************************//
void cursor_forward_stuff(char x)
{
//	if(data_entry_mode)
	if(1)
	{
		stuff_num(x);
		cursor_forward(x);
	}
}
//******************************************************************************************//
//*************************************** stuff_num ****************************************//
//******************************************************************************************//
void stuff_num(char num)
{
	num += 0x30;
	cur_global_number[cur_col-NUM_ENTRY_BEGIN_COL] = num;
}
//******************************************************************************************//
//************************************* cursor_forward *************************************//
//******************************************************************************************//
void cursor_forward(char ch)
{
	if(++cur_col > NUM_ENTRY_END_COL)
		cur_col = NUM_ENTRY_BEGIN_COL;
}
//******************************************************************************************//
//***************************************** backspace **************************************//
//******************************************************************************************//
UCHAR backspace(UCHAR ch)
{
//	if(data_entry_mode)
	if(1)
	{
		cursor_backward();
		cur_global_number[cur_col-NUM_ENTRY_BEGIN_COL] = 0x20;
	}
	return ch;
}
//******************************************************************************************//
//**************************************** _eclear *******************************************//
//******************************************************************************************//
void _eclear(void)
{
	cur_row = NUM_ENTRY_ROW;
	cur_col = NUM_ENTRY_BEGIN_COL;
	memset((void*)new_global_number,0,NUM_ENTRY_SIZE);
	memset((void*)cur_global_number,0,NUM_ENTRY_SIZE);
}
//******************************************************************************************//
//************************************* cursor_backward ************************************//
//******************************************************************************************//
void cursor_backward(void)
{
	if(--cur_col < NUM_ENTRY_BEGIN_COL)
		cur_col = NUM_ENTRY_BEGIN_COL;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
UCHAR do_exec(UCHAR ch)
{
	UCHAR ret_char = ch;
	int i;
	int menu_index = 0;

//strcpy((char *)state,"do_exec    \0");

	switch(ch)
	{
		case KP_A:
		scrollup_execchoice(ch);
//		strcpy((char *)state,"exec up     \0");
		break;
		case KP_B:
		scrolldown_execchoice(ch);
//		strcpy((char *)state,"exec down    \0");
		break;
		case KP_C:
		prev_list();
//		strcpy((char *)state,"exec enter   \0");
		break;
		case KP_D:
		break;
		case KP_POUND:
		break;
		case KP_0:
		break;
		case KP_AST:
		prev_list();
		break;
		default:
		break;
	}
//	if(ch != KP_AST)
	for(i = 0;i < NUM_CHECKBOXES;i++)
		avr_send_data[AVR_SEND_DATA_SIZE-NUM_CHECKBOXES-1+i] = check_boxes[i].checked;

	return ret_char;
}

//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
UCHAR do_chkbox(UCHAR ch)
{
	UCHAR ret_char = ch;
	int i;

//	strcpy((char *)state,"do_chkbox        \0");

	switch(ch)
	{
		case KP_A:
		scrollup_checkboxes(ch);
//		strcpy((char *)state,"ckbox up    \0");
		break;
		case KP_B:
		scrolldown_checkboxes(ch);
//		strcpy((char *)state,"ckbox down    \0");
		break;
		case KP_C:
		toggle_checkboxes(ch);
//		strcpy((char *)state,"ckbox  toggle  \0");
		break;
		case KP_D:		// enter
//		strcpy((char *)state,"ckbox enter    \0");
		prev_list();
		break;
		case KP_POUND:		// esc
//		strcpy((char *)state,"ckbox esc    \0");
		for(i = 0;i < NUM_CHECKBOXES;i++)
			check_boxes[i].checked = prev_check_boxes[i];	// restore old
		for(i = 0;i < NUM_CHECKBOXES;i++)
			avr_send_data[AVR_SEND_DATA_SIZE-NUM_CHECKBOXES-1+i] = 0;
		prev_list();
		break;
		case KP_0:
		break;
		case KP_AST:
		prev_list();
		break;
		default:
		break;
	}
	for(i = 0;i < NUM_CHECKBOXES;i++)
		avr_send_data[AVR_SEND_DATA_SIZE-NUM_CHECKBOXES-1+i] = check_boxes[i].checked;

	return ret_char;
}
//******************************************************************************************//
//************************************* init_checkboxes ************************************//
//******************************************************************************************//
UCHAR init_checkboxes(UCHAR ch)
{
	curr_checkbox = 0;
	int i;
	int j = 0;
	int k = 0;

