EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
			unpack(start_addr,&low_byte,&high_byte);
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,high_byte);
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);

			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(_size>>8));
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)_size);
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
			for(i = 0;i < _size;i++)
			{
				__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,avr_send_data[i]);
				ESOS_TASK_WAIT_TICKS(20);
			}
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)i);
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
		}
		else if(wkey == READ_EEPROM)
		{
			avr_ptr = 0;
//			ESOS_KILL_TASK(get_comm_handle);
/*
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(_size>>8));
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)_size);
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(start_addr>>8));
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)start_addr);
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
*/
			low_byte = READ_EEPROM;
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);

			unpack(_size,&low_byte,&high_byte);
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,high_byte);
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);

			unpack(start_addr,&low_byte,&high_byte);
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,high_byte);
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);
/*
			for(i = 0;i < _size;i++)
			{
				ESOS_TASK_WAIT_ON_AVAILABLE_IN_COMM2();
				ESOS_TASK_WAIT_ON_GET_UINT82(low_byte);
				ESOS_TASK_SIGNAL_AVAILABLE_IN_COMM2();

				ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
				ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING(low_byte);
				ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
			}
			ESOS_RESTART_TASK(get_comm_handle);
*/
		}

		else if(wkey == TEST1)
		{
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');

			for(i = 0; i < AVR_SEND_DATA_SIZE;i++)
				ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING(avr_send_data[i]);

			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();

		}
		else if(wkey == TEST2)
		{
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');

			for(i = TEMP_EEPROM_OFFSET; i < AVR_SEND_DATA_SIZE;i++)
			{
				if(avr_send_data[i] > 0x1f && avr_send_data[i] < 0x7e)
					ESOS_TASK_WAIT_ON_SEND_UINT8(avr_send_data[i]);
				else if(avr_send_data[i] == 0)
					ESOS_TASK_WAIT_ON_SEND_UINT8(0x20);
				else if( avr_send_data[i] == 0xff)
					ESOS_TASK_WAIT_ON_SEND_UINT8('_');
				else
					ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING(avr_send_data[i]);
			}
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
		}
		else if(wkey == TEST3)
		{
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
			for(i = 0;i < 400;i++)
			{
				if(avr_send_data[i] > 0x1f && avr_send_data[i] < 0x7e)
					ESOS_TASK_WAIT_ON_SEND_UINT8(avr_send_data[i]);
				else if(avr_send_data[i] == 0)
					ESOS_TASK_WAIT_ON_SEND_UINT8(0x20);
				else if( avr_send_data[i] == 0xff)
					ESOS_TASK_WAIT_ON_SEND_UINT8('_');
				else
					ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING(avr_send_data[i]);
			}
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
		}
		else if(wkey == TEST4)
		{
			memset(avr_send_data+300,0xff,AVR_SEND_DATA_SIZE-300);
			avr_ptr = 0;
		}
		else if(wkey == TEST5)
		{
			low_byte = TEST5;
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);
		}
		else if(wkey == TEST6)
		{
			_size = TEMP_EEPROM_OFFSET;
			start_addr = TEMP_EEPROM_OFFSET;
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)_size);
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(_size>>8));
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)start_addr);
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(start_addr>>8));
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
		}

		else if(wkey == TEST7)
		{
			_size = 30;
			start_addr = 30;
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)_size);
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(_size>>8));
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)start_addr);
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(start_addr>>8));
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
		}
		else if(wkey == TEST8)
		{
			_size = 100;
			start_addr = 0;
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)_size);
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(_size>>8));
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)start_addr);
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(start_addr>>8));
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
		}
		else if(wkey == TEST9)
		{
			_size = 300;
			start_addr = 300;
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)_size);
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(_size>>8));
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)start_addr);
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(start_addr>>8));
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
		}
		else if(wkey == TEST10)
		{
			_size = 300;
			start_addr = 0;
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)_size);
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(_size>>8));
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)start_addr);
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(start_addr>>8));
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
		}
		else if(wkey == TEST11)
		{
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,wkey);
		}
		else if(wkey == INIT)
		{
			_size = 234;
			start_addr = 0;
			ESOS_RESTART_TASK(send_comm_handle);
			ESOS_RESTART_TASK(get_comm_handle);
			ESOS_RESTART_TASK(comm2_handle);
			ESOS_TASK_RESTART();
		}
		else if(wkey == SPACE)
		{
			low_byte = SPACE;
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);
		}
		else
			__esos_CB_WriteUINT8(comm2_handle->pst_Mailbox->pst_CBuffer,wkey);

